Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::ElementBase Class Reference
MEP Element Manager
#include <MEPElementBase.hpp>
 Inheritance diagram for ACAPI::MEP::ElementBase:
 Public Member Functions
bool  | Exists () const
std::vector< UniqueID >  | GetPortIDs () const
std::vector< UniqueID >  | GetDirectConnectedMEPElementIds () const
API_Coord3D  | GetAnchorPoint () const
Orientation  | GetOrientation () const
API_Guid  | GetObjectId () const
 Public Member Functions inherited from ACAPI::ElementBase
UniqueID  | GetElemId () const
Get unique identifier of the ElementBase object.
Result< void >  | IsEditable () const
Checks whether the element is editable.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions
ElementBase (std::shared_ptr< Impl::IElementBaseImpl > impl)
Constructs an ElementBase with an element base implementation.
 Protected Member Functions inherited from ACAPI::ElementBase
ElementBase (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new ElementBase.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
It is a collection of common MEP attributes that can be handled through this parent entity.
Since
Archicad 27
Constructor & Destructor Documentation
◆ ElementBase()
 ACAPI::MEP::ElementBase::ElementBase  |  ( |  std::shared_ptr< Impl::IElementBaseImpl > |  impl | )
protected
Constructs an ElementBase with an element base implementation.
Parameters
impl | The element base implementation.
Member Function Documentation
◆ Exists()
 bool ACAPI::MEP::ElementBase::Exists  |  ( |   | ) |   const
Returns
Checks if the element still exists.
◆ GetAnchorPoint()
 API_Coord3D ACAPI::MEP::ElementBase::GetAnchorPoint  |  ( |   | ) |   const
Returns
Returns the anchor point of the element.
◆ GetDirectConnectedMEPElementIds()
 std::vector< UniqueID > ACAPI::MEP::ElementBase::GetDirectConnectedMEPElementIds  |  ( |   | ) |   const
Returns
Returns the UniqueIDs of the connected MEP elements.
◆ GetObjectId()
 API_Guid ACAPI::MEP::ElementBase::GetObjectId  |  ( |   | ) |   const
Returns
Returns the main GUID of the referenced Library Part.
◆ GetOrientation()
 Orientation ACAPI::MEP::ElementBase::GetOrientation  |  ( |   | ) |   const
Returns
Returns the orientation of the element, which is based on a direction vector and a rotation vector.
◆ GetPortIDs()
 std::vector< UniqueID > ACAPI::MEP::ElementBase::GetPortIDs  |  ( |   | ) |   const
Returns
Returns the IDs of the element's ports.